tutorials/cfdemSolverRhoPimple/HeatTransferRanzMarshall/CFD/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    wall
    {
        type        fixedValue;
        value       uniform 298.15;
    }

    inlet
    {
        type        fixedValue;
        value       uniform 298.15;
    }

    outlet
    {
        type        zeroGradient;
    }
}


// ************************************************************************* //
