tutorials/cfdemSolverRhoPimple/HeatTransferRanzMarshall/CFD/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// sub-models & settings

syncMode false;

modelType "A"; // A or B

couplingInterval 50;

voidFractionModel centre;

locateModel engine;

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel off;

probeModel off;

dataExchangeModel twoWayMPI;

averagingModel dilute;

clockModel off;

smoothingModel off;

forceModels
(
    gradPForce
    viscForce
    noDrag
);

energyModels
(
    heatTransferRanzMarshall
);

//massTransferModels
//(
//);

chemistryModels
(
    off
);

momCoupleModels
(
    implicitCouple
);

thermCondModel SyamlalThermCond;

//diffCoeffModel  off;

turbulenceModelType "turbulenceProperties";



// sub-model properties


heatTransferRanzMarshallProps
{
    partTempName "Temp";
    partHeatFluxName "convectiveHeatFlux";
    calcPartTempField true;
    partRefTemp 373.15;
    interpolation false;
}

SyamlalThermCondProps
{
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
}

engineProps
{
    treeSearch true;
}

centreProps
{
    alphaMin 0.01;
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

// ************************************************************************* //
