tutorials/cfdemSolverRhoPimple/HeatTransferRanzMarshall/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.1188  0.1188 0.0 )
    (-0.1188  0.1188 0.0 )
    (-0.1188 -0.1188 0.0 )
    ( 0.1188 -0.1188 0.0 )

    ( 0.1188  0.1188 0.216)
    (-0.1188  0.1188 0.216)
    (-0.1188 -0.1188 0.216)
    ( 0.1188 -0.1188 0.216)
);

blocks
(
    hex (2 3 0 1 6 7 4 5) (11 11 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 0 4 5)
            (2 1 5 6)
            (3 2 6 7)
            (0 3 7 4)
        );
    }
);


// ************************************************************************* //
