tutorials/cfdemSolverRhoPimple/HeatTransferRanzMarshall/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|rho|rhoeps)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(p|rho|rhoeps)Final"
    {
        $p;
        relTol          0;
    }

    "(U|k|e|epsilon|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    "(U|e|k|nuTilda)Final"
    {
        $U;
        relTol          0;
    }

    "(voidfraction|Us|Ksl|dSmoothing|UsNext|voidfractionNext)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }

    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 3;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;

    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.5;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.0;
    pMinFactor      0.5;
    pMaxFactor      2.0;
}

relaxationFactors
{
    equations
    {
        ".*"  1;
    }
}


// ************************************************************************* //
